testing/archive/load_test_4_24_2025__2_30_41_pm.log
2025-04-24 14:30:41,744 - Test start time: 4_24_2025__2_30_41_pm
2025-04-24 14:30:42,016 - Test Started: 16:30 rate: 40 pods: 1
2025-04-24 14:31:42,311 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 154.680ms, rate sampling interval: 429ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   577.27ms  546.75ms   2.10s    48.23%
    Req/Sec    33.91      4.16    46.00     82.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  205.95ms
 75.000%    1.21s 
 90.000%    1.22s 
 99.000%    2.03s 
 99.900%    2.04s 
 99.990%    2.10s 
 99.999%    2.10s 
100.000%    2.10s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.355     0.000000            1         1.00
       7.979     0.100000          173         1.11
      25.999     0.200000          345         1.25
     194.303     0.300000          518         1.43
     199.807     0.400000          690         1.67
     205.951     0.500000          862         2.00
     213.247     0.550000          948         2.22
    1019.391     0.600000         1034         2.50
    1025.535     0.650000         1120         2.86
    1044.991     0.700000         1206         3.33
    1206.271     0.750000         1291         4.00
    1209.343     0.775000         1340         4.44
    1211.391     0.800000         1388         5.00
    1213.439     0.825000         1427         5.71
    1215.487     0.850000         1483         6.67
    1217.535     0.875000         1527         8.00
    1218.559     0.887500         1549         8.89
    1218.559     0.900000         1549        10.00
    1219.583     0.912500         1573        11.43
    1221.631     0.925000         1605        13.33
    1222.655     0.937500         1620        16.00
    1223.679     0.943750         1633        17.78
    1224.703     0.950000         1642        20.00
    1225.727     0.956250         1651        22.86
    1226.751     0.962500         1657        26.67
    1228.799     0.968750         1676        32.00
    1228.799     0.971875         1676        35.56
    1229.823     0.975000         1680        40.00
    1231.871     0.978125         1685        45.71
    1236.991     0.981250         1689        53.33
    1299.455     0.984375         1695        64.00
    2027.519     0.985938         1699        71.11
    2028.543     0.987500         1701        80.00
    2029.567     0.989062         1703        91.43
    2030.591     0.990625         1705       106.67
    2034.687     0.992188         1708       128.00
    2035.711     0.992969         1711       142.22
    2035.711     0.993750         1711       160.00
    2036.735     0.994531         1712       182.86
    2037.759     0.995313         1713       213.33
    2039.807     0.996094         1715       256.00
    2039.807     0.996484         1715       284.44
    2040.831     0.996875         1716       320.00
    2041.855     0.997266         1718       365.71
    2041.855     0.997656         1718       426.67
    2041.855     0.998047         1718       512.00
    2041.855     0.998242         1718       568.89
    2042.879     0.998437         1719       640.00
    2042.879     0.998633         1719       731.43
    2042.879     0.998828         1719       853.33
    2045.951     0.999023         1720      1024.00
    2045.951     0.999121         1720      1137.78
    2045.951     0.999219         1720      1280.00
    2045.951     0.999316         1720      1462.86
    2045.951     0.999414         1720      1706.67
    2101.247     0.999512         1721      2048.00
    2101.247     1.000000         1721          inf
#[Mean    =      577.268, StdDeviation   =      546.752]
#[Max     =     2099.200, Total count    =         1721]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2067 requests in 1.00m, 25.62MB read
  Socket errors: connect 0, read 0, write 0, timeout 29
Requests/sec:     34.44
Transfer/sec:    437.08KB

2025-04-24 14:31:42,611 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 14:31:42,891 - Test Started: 16:31 rate: 40 pods: 1
2025-04-24 14:32:43,194 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 150.220ms, rate sampling interval: 426ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   190.95ms  291.41ms   1.07s    90.41%
    Req/Sec    34.21      3.98    49.00     85.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  185.85ms
 75.000%  200.83ms
 90.000%  223.10ms
 99.000%    1.05s 
 99.900%    1.06s 
 99.990%    1.07s 
 99.999%    1.07s 
100.000%    1.07s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.087     0.000000            1         1.00
       7.195     0.100000          175         1.11
      12.791     0.200000          349         1.25
      18.527     0.300000          523         1.43
      23.359     0.400000          698         1.67
     185.855     0.500000          872         2.00
     189.695     0.550000          959         2.22
     192.767     0.600000         1047         2.50
     195.199     0.650000         1133         2.86
     197.631     0.700000         1220         3.33
     200.831     0.750000         1306         4.00
     202.879     0.775000         1352         4.44
     204.543     0.800000         1394         5.00
     206.463     0.825000         1438         5.71
     209.535     0.850000         1480         6.67
     212.863     0.875000         1525         8.00
     217.471     0.887500         1547         8.89
     223.103     0.900000         1567        10.00
    1034.239     0.912500         1591        11.43
    1038.335     0.925000         1613        13.33
    1041.407     0.937500         1637        16.00
    1042.943     0.943750         1647        17.78
    1043.967     0.950000         1656        20.00
    1046.015     0.956250         1668        22.86
    1047.039     0.962500         1678        26.67
    1048.063     0.968750         1688        32.00
    1048.575     0.971875         1693        35.56
    1050.623     0.975000         1706        40.00
    1050.623     0.978125         1706        45.71
    1051.647     0.981250         1710        53.33
    1052.671     0.984375         1719        64.00
    1052.671     0.985938         1719        71.11
    1053.695     0.987500         1721        80.00
    1054.719     0.989062         1730        91.43
    1054.719     0.990625         1730       106.67
    1054.719     0.992188         1730       128.00
    1054.719     0.992969         1730       142.22
    1056.767     0.993750         1731       160.00
    1057.791     0.994531         1733       182.86
    1057.791     0.995313         1733       213.33
    1058.815     0.996094         1735       256.00
    1058.815     0.996484         1735       284.44
    1059.839     0.996875         1736       320.00
    1060.863     0.997266         1738       365.71
    1060.863     0.997656         1738       426.67
    1060.863     0.998047         1738       512.00
    1060.863     0.998242         1738       568.89
    1061.887     0.998437         1739       640.00
    1061.887     0.998633         1739       731.43
    1061.887     0.998828         1739       853.33
    1064.959     0.999023         1740      1024.00
    1064.959     0.999121         1740      1137.78
    1064.959     0.999219         1740      1280.00
    1064.959     0.999316         1740      1462.86
    1064.959     0.999414         1740      1706.67
    1067.007     0.999512         1741      2048.00
    1067.007     1.000000         1741          inf
#[Mean    =      190.950, StdDeviation   =      291.407]
#[Max     =     1065.984, Total count    =         1741]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2094 requests in 1.00m, 26.24MB read
  Socket errors: connect 0, read 0, write 0, timeout 29
Requests/sec:     34.89
Transfer/sec:    447.69KB

2025-04-24 14:32:43,499 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 14:32:43,783 - Test Started: 16:32 rate: 40 pods: 1
2025-04-24 14:33:44,111 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 303.825ms, rate sampling interval: 2396ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   445.39ms  463.88ms   1.27s    73.30%
    Req/Sec    34.40      0.92    35.00     95.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  209.02ms
 75.000%    1.19s 
 90.000%    1.21s 
 99.000%    1.22s 
 99.900%    1.27s 
 99.990%    1.28s 
 99.999%    1.28s 
100.000%    1.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.963     0.000000            1         1.00
       8.903     0.100000          174         1.11
     200.703     0.200000          348         1.25
     204.159     0.300000          524         1.43
     206.719     0.400000          699         1.67
     209.023     0.500000          873         2.00
     210.559     0.550000          961         2.22
     212.223     0.600000         1046         2.50
     214.399     0.650000         1129         2.86
     217.343     0.700000         1216         3.33
    1193.983     0.750000         1306         4.00
    1197.055     0.775000         1352         4.44
    1199.103     0.800000         1389         5.00
    1201.151     0.825000         1431         5.71
    1203.199     0.850000         1478         6.67
    1205.247     0.875000         1527         8.00
    1206.271     0.887500         1549         8.89
    1207.295     0.900000         1564        10.00
    1208.319     0.912500         1588        11.43
    1209.343     0.925000         1605        13.33
    1211.391     0.937500         1638        16.00
    1211.391     0.943750         1638        17.78
    1212.415     0.950000         1650        20.00
    1213.439     0.956250         1664        22.86
    1214.463     0.962500         1680        26.67
    1214.463     0.968750         1680        32.00
    1215.487     0.971875         1693        35.56
    1215.487     0.975000         1693        40.00
    1216.511     0.978125         1703        45.71
    1216.511     0.981250         1703        53.33
    1217.535     0.984375         1711        64.00
    1217.535     0.985938         1711        71.11
    1218.559     0.987500         1716        80.00
    1218.559     0.989062         1716        91.43
    1220.607     0.990625         1721       106.67
    1220.607     0.992188         1721       128.00
    1222.655     0.992969         1722       142.22
    1225.727     0.993750         1725       160.00
    1225.727     0.994531         1725       182.86
    1228.799     0.995313         1726       213.33
    1268.735     0.996094         1728       256.00
    1268.735     0.996484         1728       284.44
    1269.759     0.996875         1729       320.00
    1270.783     0.997266         1731       365.71
    1270.783     0.997656         1731       426.67
    1270.783     0.998047         1731       512.00
    1270.783     0.998242         1731       568.89
    1273.855     0.998437         1732       640.00
    1273.855     0.998633         1732       731.43
    1273.855     0.998828         1732       853.33
    1275.903     0.999023         1734      1024.00
    1275.903     1.000000         1734          inf
#[Mean    =      445.391, StdDeviation   =      463.885]
#[Max     =     1274.880, Total count    =         1734]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2082 requests in 1.00m, 26.09MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
Requests/sec:     34.70
Transfer/sec:    445.17KB

2025-04-24 14:33:44,400 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 14:33:44,681 - Test Started: 16:33 rate: 40 pods: 1
2025-04-24 14:34:45,009 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 395.619ms, rate sampling interval: 436ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   806.69ms    2.08s    7.20s    87.03%
    Req/Sec    39.59      5.24    55.00     85.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.38ms
 75.000%   15.65ms
 90.000%    5.59s 
 99.000%    7.00s 
 99.900%    7.20s 
 99.990%    7.21s 
 99.999%    7.21s 
100.000%    7.21s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.903     0.000000            1         1.00
       4.223     0.100000          201         1.11
       5.607     0.200000          401         1.25
       7.131     0.300000          603         1.43
       8.639     0.400000          802         1.67
      10.383     0.500000         1003         2.00
      11.367     0.550000         1103         2.22
      12.415     0.600000         1206         2.50
      13.471     0.650000         1305         2.86
      14.495     0.700000         1405         3.33
      15.655     0.750000         1506         4.00
      16.527     0.775000         1554         4.44
      18.271     0.800000         1604         5.00
      21.039     0.825000         1657         5.71
      25.199     0.850000         1705         6.67
    5005.311     0.875000         1763         8.00
    5201.919     0.887500         1780         8.89
    5591.039     0.900000         1805        10.00
    5808.127     0.912500         1830        11.43
    6184.959     0.925000         1856        13.33
    6205.439     0.937500         1883        16.00
    6377.471     0.943750         1895        17.78
    6389.759     0.950000         1905        20.00
    6582.271     0.956250         1918        22.86
    6598.655     0.962500         1932        26.67
    6791.167     0.968750         1945        32.00
    6795.263     0.971875         1952        35.56
    6799.359     0.975000         1956        40.00
    6807.551     0.978125         1965        45.71
    6979.583     0.981250         1968        53.33
    6987.775     0.984375         1978        64.00
    6987.775     0.985938         1978        71.11
    6991.871     0.987500         1984        80.00
    6991.871     0.989062         1984        91.43
    7000.063     0.990625         1988       106.67
    7004.159     0.992188         1991       128.00
    7004.159     0.992969         1991       142.22
    7180.287     0.993750         1994       160.00
    7192.575     0.994531         1999       182.86
    7192.575     0.995313         1999       213.33
    7192.575     0.996094         1999       256.00
    7192.575     0.996484         1999       284.44
    7192.575     0.996875         1999       320.00
    7200.767     0.997266         2002       365.71
    7200.767     0.997656         2002       426.67
    7200.767     0.998047         2002       512.00
    7200.767     0.998242         2002       568.89
    7200.767     0.998437         2002       640.00
    7204.863     0.998633         2004       731.43
    7204.863     0.998828         2004       853.33
    7204.863     0.999023         2004      1024.00
    7204.863     0.999121         2004      1137.78
    7204.863     0.999219         2004      1280.00
    7204.863     0.999316         2004      1462.86
    7204.863     0.999414         2004      1706.67
    7208.959     0.999512         2005      2048.00
    7208.959     1.000000         2005          inf
#[Mean    =      806.686, StdDeviation   =     2077.057]
#[Max     =     7204.864, Total count    =         2005]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2376 requests in 1.00m, 29.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:     39.59
Transfer/sec:    502.89KB

2025-04-24 14:34:45,308 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 14:34:45,601 - Test Started: 16:34 rate: 70 pods: 2
2025-04-24 14:35:45,856 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 14.723ms, rate sampling interval: 49ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.57ms    5.11ms  46.56ms   70.17%
    Req/Sec    70.39     56.17   166.00     59.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.58ms
 75.000%   12.73ms
 90.000%   15.69ms
 99.000%   26.25ms
 99.900%   35.39ms
 99.990%   46.59ms
 99.999%   46.59ms
100.000%   46.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.904     0.000000            1         1.00
       4.011     0.100000          350         1.11
       4.923     0.200000          701         1.25
       6.043     0.300000         1051         1.43
       7.315     0.400000         1399         1.67
       8.583     0.500000         1751         2.00
       9.391     0.550000         1925         2.22
      10.135     0.600000         2098         2.50
      10.951     0.650000         2273         2.86
      11.863     0.700000         2450         3.33
      12.727     0.750000         2623         4.00
      13.191     0.775000         2711         4.44
      13.663     0.800000         2798         5.00
      14.103     0.825000         2887         5.71
      14.615     0.850000         2973         6.67
      15.215     0.875000         3061         8.00
      15.471     0.887500         3103         8.89
      15.695     0.900000         3147        10.00
      16.079     0.912500         3192        11.43
      16.623     0.925000         3236        13.33
      17.471     0.937500         3278        16.00
      17.983     0.943750         3300        17.78
      18.639     0.950000         3322        20.00
      19.519     0.956250         3345        22.86
      20.239     0.962500         3365        26.67
      21.007     0.968750         3388        32.00
      21.279     0.971875         3398        35.56
      21.823     0.975000         3409        40.00
      22.367     0.978125         3420        45.71
      23.199     0.981250         3431        53.33
      23.727     0.984375         3442        64.00
      24.239     0.985938         3447        71.11
      25.551     0.987500         3453        80.00
      26.031     0.989062         3458        91.43
      26.351     0.990625         3464       106.67
      27.791     0.992188         3469       128.00
      27.967     0.992969         3472       142.22
      28.399     0.993750         3475       160.00
      29.151     0.994531         3477       182.86
      29.903     0.995313         3480       213.33
      30.191     0.996094         3483       256.00
      30.271     0.996484         3484       284.44
      30.575     0.996875         3486       320.00
      30.911     0.997266         3487       365.71
      31.279     0.997656         3488       426.67
      33.055     0.998047         3490       512.00
      33.055     0.998242         3490       568.89
      34.111     0.998437         3491       640.00
      34.623     0.998633         3492       731.43
      34.623     0.998828         3492       853.33
      35.391     0.999023         3493      1024.00
      35.391     0.999121         3493      1137.78
      35.967     0.999219         3494      1280.00
      35.967     0.999316         3494      1462.86
      35.967     0.999414         3494      1706.67
      39.327     0.999512         3495      2048.00
      39.327     0.999561         3495      2275.56
      39.327     0.999609         3495      2560.00
      39.327     0.999658         3495      2925.71
      39.327     0.999707         3495      3413.33
      46.591     0.999756         3496      4096.00
      46.591     1.000000         3496          inf
#[Mean    =        9.571, StdDeviation   =        5.113]
#[Max     =       46.560, Total count    =         3496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4201 requests in 1.00m, 51.64MB read
Requests/sec:     70.01
Transfer/sec:      0.86MB

2025-04-24 14:35:46,116 - Test completed: wrk2 -t1 -c8 -d60s -R70 --latency http://128.105.146.155/
2025-04-24 14:35:46,387 - Test Started: 16:35 rate: 70 pods: 2
2025-04-24 14:36:46,676 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 17.952ms, rate sampling interval: 49ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.86ms    5.59ms  46.08ms   75.34%
    Req/Sec    70.38     56.04   166.00     58.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.81ms
 75.000%   12.87ms
 90.000%   16.09ms
 99.000%   30.35ms
 99.900%   38.24ms
 99.990%   46.11ms
 99.999%   46.11ms
100.000%   46.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.802     0.000000            1         1.00
       4.051     0.100000          350         1.11
       5.055     0.200000          701         1.25
       6.107     0.300000         1050         1.43
       7.351     0.400000         1399         1.67
       8.815     0.500000         1748         2.00
       9.551     0.550000         1923         2.22
      10.327     0.600000         2099         2.50
      11.127     0.650000         2274         2.86
      11.959     0.700000         2448         3.33
      12.871     0.750000         2624         4.00
      13.271     0.775000         2710         4.44
      13.727     0.800000         2797         5.00
      14.223     0.825000         2885         5.71
      14.791     0.850000         2972         6.67
      15.367     0.875000         3059         8.00
      15.719     0.887500         3103         8.89
      16.111     0.900000         3147        10.00
      16.847     0.912500         3192        11.43
      17.935     0.925000         3235        13.33
      18.959     0.937500         3279        16.00
      19.711     0.943750         3300        17.78
      20.431     0.950000         3322        20.00
      21.007     0.956250         3344        22.86
      21.839     0.962500         3365        26.67
      22.959     0.968750         3387        32.00
      23.439     0.971875         3398        35.56
      24.159     0.975000         3410        40.00
      25.455     0.978125         3420        45.71
      26.447     0.981250         3431        53.33
      27.423     0.984375         3442        64.00
      27.951     0.985938         3447        71.11
      28.623     0.987500         3454        80.00
      29.551     0.989062         3458        91.43
      30.463     0.990625         3464       106.67
      30.959     0.992188         3469       128.00
      31.471     0.992969         3472       142.22
      32.175     0.993750         3475       160.00
      32.463     0.994531         3477       182.86
      33.631     0.995313         3480       213.33
      34.335     0.996094         3483       256.00
      34.751     0.996484         3484       284.44
      35.487     0.996875         3486       320.00
      35.935     0.997266         3487       365.71
      36.607     0.997656         3488       426.67
      36.703     0.998047         3491       512.00
      36.703     0.998242         3491       568.89
      36.703     0.998437         3491       640.00
      36.767     0.998633         3492       731.43
      36.767     0.998828         3492       853.33
      38.239     0.999023         3493      1024.00
      38.239     0.999121         3493      1137.78
      38.943     0.999219         3494      1280.00
      38.943     0.999316         3494      1462.86
      38.943     0.999414         3494      1706.67
      42.847     0.999512         3495      2048.00
      42.847     0.999561         3495      2275.56
      42.847     0.999609         3495      2560.00
      42.847     0.999658         3495      2925.71
      42.847     0.999707         3495      3413.33
      46.111     0.999756         3496      4096.00
      46.111     1.000000         3496          inf
#[Mean    =        9.857, StdDeviation   =        5.594]
#[Max     =       46.080, Total count    =         3496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4201 requests in 1.00m, 52.23MB read
Requests/sec:     70.01
Transfer/sec:      0.87MB

2025-04-24 14:36:46,953 - Test completed: wrk2 -t1 -c8 -d60s -R70 --latency http://128.105.146.155/
2025-04-24 14:36:47,232 - Test Started: 16:36 rate: 70 pods: 2
2025-04-24 14:37:47,531 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 14.340ms, rate sampling interval: 41ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.45ms    4.35ms  75.84ms   69.14%
    Req/Sec    70.73     66.34   200.00     44.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.61ms
 75.000%   11.35ms
 90.000%   14.26ms
 99.000%   19.33ms
 99.900%   28.98ms
 99.990%   75.90ms
 99.999%   75.90ms
100.000%   75.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.747     0.000000            1         1.00
       3.801     0.100000          350         1.11
       4.575     0.200000          701         1.25
       5.419     0.300000         1050         1.43
       6.439     0.400000         1401         1.67
       7.607     0.500000         1748         2.00
       8.287     0.550000         1923         2.22
       9.007     0.600000         2101         2.50
       9.799     0.650000         2273         2.86
      10.503     0.700000         2448         3.33
      11.351     0.750000         2624         4.00
      11.791     0.775000         2711         4.44
      12.183     0.800000         2797         5.00
      12.695     0.825000         2885         5.71
      13.255     0.850000         2972         6.67
      13.783     0.875000         3061         8.00
      14.055     0.887500         3104         8.89
      14.271     0.900000         3149        10.00
      14.503     0.912500         3191        11.43
      14.775     0.925000         3237        13.33
      15.087     0.937500         3278        16.00
      15.199     0.943750         3300        17.78
      15.359     0.950000         3322        20.00
      15.519     0.956250         3345        22.86
      15.679     0.962500         3365        26.67
      15.871     0.968750         3387        32.00
      16.031     0.971875         3399        35.56
      16.311     0.975000         3409        40.00
      16.623     0.978125         3420        45.71
      17.167     0.981250         3431        53.33
      17.967     0.984375         3442        64.00
      18.303     0.985938         3447        71.11
      18.479     0.987500         3453        80.00
      18.911     0.989062         3458        91.43
      20.111     0.990625         3464       106.67
      20.511     0.992188         3470       128.00
      20.655     0.992969         3472       142.22
      21.119     0.993750         3476       160.00
      21.247     0.994531         3477       182.86
      22.175     0.995313         3480       213.33
      22.815     0.996094         3483       256.00
      23.215     0.996484         3484       284.44
      23.855     0.996875         3486       320.00
      24.047     0.997266         3487       365.71
      24.335     0.997656         3488       426.67
      27.183     0.998047         3491       512.00
      27.183     0.998242         3491       568.89
      27.183     0.998437         3491       640.00
      27.887     0.998633         3492       731.43
      27.887     0.998828         3492       853.33
      28.975     0.999023         3493      1024.00
      28.975     0.999121         3493      1137.78
      31.087     0.999219         3494      1280.00
      31.087     0.999316         3494      1462.86
      31.087     0.999414         3494      1706.67
      68.607     0.999512         3495      2048.00
      68.607     0.999561         3495      2275.56
      68.607     0.999609         3495      2560.00
      68.607     0.999658         3495      2925.71
      68.607     0.999707         3495      3413.33
      75.903     0.999756         3496      4096.00
      75.903     1.000000         3496          inf
#[Mean    =        8.450, StdDeviation   =        4.346]
#[Max     =       75.840, Total count    =         3496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4201 requests in 1.00m, 51.52MB read
Requests/sec:     70.01
Transfer/sec:      0.86MB

2025-04-24 14:37:47,837 - Test completed: wrk2 -t1 -c8 -d60s -R70 --latency http://128.105.146.155/
2025-04-24 14:37:48,131 - Test Started: 16:37 rate: 110 pods: 3
2025-04-24 14:38:48,433 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 9.124ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.49ms    4.27ms  89.28ms   66.54%
    Req/Sec   111.79     68.85   285.00     56.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.59ms
 75.000%   11.56ms
 90.000%   14.27ms
 99.000%   18.98ms
 99.900%   24.80ms
 99.990%   68.61ms
 99.999%   89.34ms
100.000%   89.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.904     0.000000            1         1.00
       3.811     0.100000          550         1.11
       4.611     0.200000         1100         1.25
       5.435     0.300000         1650         1.43
       6.467     0.400000         2199         1.67
       7.595     0.500000         2749         2.00
       8.231     0.550000         3027         2.22
       9.031     0.600000         3298         2.50
       9.831     0.650000         3573         2.86
      10.711     0.700000         3848         3.33
      11.559     0.750000         4124         4.00
      11.967     0.775000         4262         4.44
      12.431     0.800000         4400         5.00
      12.879     0.825000         4535         5.71
      13.359     0.850000         4673         6.67
      13.791     0.875000         4809         8.00
      14.047     0.887500         4879         8.89
      14.271     0.900000         4947        10.00
      14.527     0.912500         5017        11.43
      14.783     0.925000         5086        13.33
      15.095     0.937500         5154        16.00
      15.247     0.943750         5189        17.78
      15.383     0.950000         5224        20.00
      15.519     0.956250         5256        22.86
      15.711     0.962500         5290        26.67
      15.983     0.968750         5325        32.00
      16.151     0.971875         5346        35.56
      16.311     0.975000         5359        40.00
      16.671     0.978125         5377        45.71
      17.007     0.981250         5393        53.33
      17.471     0.984375         5411        64.00
      17.727     0.985938         5419        71.11
      18.287     0.987500         5429        80.00
      18.575     0.989062         5436        91.43
      19.119     0.990625         5445       106.67
      19.455     0.992188         5454       128.00
      19.695     0.992969         5458       142.22
      19.935     0.993750         5462       160.00
      20.255     0.994531         5466       182.86
      20.751     0.995313         5471       213.33
      22.031     0.996094         5475       256.00
      22.191     0.996484         5477       284.44
      22.303     0.996875         5479       320.00
      22.495     0.997266         5481       365.71
      22.831     0.997656         5484       426.67
      23.311     0.998047         5486       512.00
      23.551     0.998242         5487       568.89
      23.711     0.998437         5488       640.00
      23.759     0.998633         5489       731.43
      24.399     0.998828         5490       853.33
      24.799     0.999023         5491      1024.00
      28.719     0.999121         5492      1137.78
      28.719     0.999219         5492      1280.00
      31.423     0.999316         5493      1462.86
      31.423     0.999414         5493      1706.67
      37.983     0.999512         5494      2048.00
      37.983     0.999561         5494      2275.56
      37.983     0.999609         5494      2560.00
      68.607     0.999658         5495      2925.71
      68.607     0.999707         5495      3413.33
      68.607     0.999756         5495      4096.00
      68.607     0.999780         5495      4551.11
      68.607     0.999805         5495      5120.00
      89.343     0.999829         5496      5851.43
      89.343     1.000000         5496          inf
#[Mean    =        8.489, StdDeviation   =        4.274]
#[Max     =       89.280, Total count    =         5496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6601 requests in 1.00m, 82.04MB read
Requests/sec:    110.01
Transfer/sec:      1.37MB

2025-04-24 14:38:48,720 - Test completed: wrk2 -t1 -c8 -d60s -R110 --latency http://128.105.146.155/
2025-04-24 14:38:49,032 - Test Started: 16:38 rate: 110 pods: 4
2025-04-24 14:39:49,354 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 8.528ms, rate sampling interval: 27ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.35ms    4.07ms  70.34ms   63.41%
    Req/Sec   111.81     72.47   307.00     54.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.51ms
 75.000%   11.41ms
 90.000%   14.30ms
 99.000%   18.03ms
 99.900%   24.48ms
 99.990%   29.28ms
 99.999%   70.40ms
100.000%   70.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.944     0.000000            1         1.00
       3.807     0.100000          550         1.11
       4.499     0.200000         1101         1.25
       5.335     0.300000         1651         1.43
       6.307     0.400000         2201         1.67
       7.507     0.500000         2748         2.00
       8.143     0.550000         3024         2.22
       8.839     0.600000         3299         2.50
       9.559     0.650000         3576         2.86
      10.423     0.700000         3849         3.33
      11.407     0.750000         4122         4.00
      11.887     0.775000         4260         4.44
      12.327     0.800000         4397         5.00
      12.815     0.825000         4537         5.71
      13.239     0.850000         4674         6.67
      13.799     0.875000         4809         8.00
      14.031     0.887500         4878         8.89
      14.295     0.900000         4947        10.00
      14.575     0.912500         5018        11.43
      14.799     0.925000         5087        13.33
      15.007     0.937500         5155        16.00
      15.135     0.943750         5187        17.78
      15.271     0.950000         5223        20.00
      15.407     0.956250         5256        22.86
      15.615     0.962500         5290        26.67
      15.799     0.968750         5326        32.00
      15.903     0.971875         5342        35.56
      16.047     0.975000         5359        40.00
      16.167     0.978125         5376        45.71
      16.303     0.981250         5393        53.33
      16.767     0.984375         5411        64.00
      16.991     0.985938         5419        71.11
      17.391     0.987500         5428        80.00
      17.695     0.989062         5436        91.43
      18.143     0.990625         5446       106.67
      18.591     0.992188         5454       128.00
      18.895     0.992969         5458       142.22
      19.439     0.993750         5462       160.00
      19.647     0.994531         5466       182.86
      19.775     0.995313         5471       213.33
      20.607     0.996094         5475       256.00
      20.879     0.996484         5477       284.44
      21.279     0.996875         5479       320.00
      21.487     0.997266         5481       365.71
      22.143     0.997656         5484       426.67
      22.383     0.998047         5486       512.00
      22.463     0.998242         5487       568.89
      23.791     0.998437         5488       640.00
      24.015     0.998633         5489       731.43
      24.191     0.998828         5490       853.33
      24.479     0.999023         5491      1024.00
      24.495     0.999121         5492      1137.78
      24.495     0.999219         5492      1280.00
      24.767     0.999316         5493      1462.86
      24.767     0.999414         5493      1706.67
      26.287     0.999512         5494      2048.00
      26.287     0.999561         5494      2275.56
      26.287     0.999609         5494      2560.00
      29.279     0.999658         5495      2925.71
      29.279     0.999707         5495      3413.33
      29.279     0.999756         5495      4096.00
      29.279     0.999780         5495      4551.11
      29.279     0.999805         5495      5120.00
      70.399     0.999829         5496      5851.43
      70.399     1.000000         5496          inf
#[Mean    =        8.345, StdDeviation   =        4.075]
#[Max     =       70.336, Total count    =         5496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6601 requests in 1.00m, 81.91MB read
  Socket errors: connect 0, read 7, write 0, timeout 0
Requests/sec:    110.00
Transfer/sec:      1.36MB

2025-04-24 14:39:49,658 - Test completed: wrk2 -t1 -c8 -d60s -R110 --latency http://128.105.146.155/
2025-04-24 14:39:49,995 - Test Started: 16:39 rate: 110 pods: 5
2025-04-24 14:40:50,327 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 8.663ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.18ms    3.92ms  42.59ms   63.10%
    Req/Sec   111.77     71.53   285.00     52.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.38ms
 75.000%   11.11ms
 90.000%   14.07ms
 99.000%   16.70ms
 99.900%   22.53ms
 99.990%   36.61ms
 99.999%   42.62ms
100.000%   42.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.908     0.000000            1         1.00
       3.783     0.100000          550         1.11
       4.483     0.200000         1101         1.25
       5.219     0.300000         1650         1.43
       6.199     0.400000         2199         1.67
       7.379     0.500000         2748         2.00
       7.967     0.550000         3023         2.22
       8.655     0.600000         3298         2.50
       9.351     0.650000         3577         2.86
      10.175     0.700000         3853         3.33
      11.111     0.750000         4122         4.00
      11.559     0.775000         4262         4.44
      12.071     0.800000         4399         5.00
      12.591     0.825000         4538         5.71
      13.071     0.850000         4672         6.67
      13.543     0.875000         4809         8.00
      13.815     0.887500         4878         8.89
      14.071     0.900000         4948        10.00
      14.343     0.912500         5017        11.43
      14.631     0.925000         5085        13.33
      14.927     0.937500         5153        16.00
      15.087     0.943750         5188        17.78
      15.199     0.950000         5226        20.00
      15.311     0.956250         5259        22.86
      15.447     0.962500         5293        26.67
      15.623     0.968750         5327        32.00
      15.735     0.971875         5342        35.56
      15.823     0.975000         5359        40.00
      15.943     0.978125         5377        45.71
      16.071     0.981250         5394        53.33
      16.223     0.984375         5411        64.00
      16.319     0.985938         5421        71.11
      16.399     0.987500         5428        80.00
      16.511     0.989062         5436        91.43
      16.959     0.990625         5445       106.67
      17.407     0.992188         5455       128.00
      17.519     0.992969         5458       142.22
      17.919     0.993750         5462       160.00
      18.543     0.994531         5466       182.86
      19.215     0.995313         5471       213.33
      19.519     0.996094         5475       256.00
      19.583     0.996484         5477       284.44
      19.967     0.996875         5479       320.00
      20.175     0.997266         5481       365.71
      20.527     0.997656         5484       426.67
      20.959     0.998047         5486       512.00
      20.975     0.998242         5487       568.89
      21.807     0.998437         5488       640.00
      22.447     0.998633         5489       731.43
      22.479     0.998828         5490       853.33
      22.527     0.999023         5491      1024.00
      22.911     0.999121         5492      1137.78
      22.911     0.999219         5492      1280.00
      23.967     0.999316         5493      1462.86
      23.967     0.999414         5493      1706.67
      25.375     0.999512         5494      2048.00
      25.375     0.999561         5494      2275.56
      25.375     0.999609         5494      2560.00
      36.607     0.999658         5495      2925.71
      36.607     0.999707         5495      3413.33
      36.607     0.999756         5495      4096.00
      36.607     0.999780         5495      4551.11
      36.607     0.999805         5495      5120.00
      42.623     0.999829         5496      5851.43
      42.623     1.000000         5496          inf
#[Mean    =        8.183, StdDeviation   =        3.924]
#[Max     =       42.592, Total count    =         5496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6601 requests in 1.00m, 80.75MB read
Requests/sec:    110.00
Transfer/sec:      1.35MB

2025-04-24 14:40:50,635 - Test completed: wrk2 -t1 -c8 -d60s -R110 --latency http://128.105.146.155/